nxp-mcuxpresso/mcux-soc-svd/MCXC353/MCXC353.xml
        <register>
          <name>CMD_CHECK</name>
          <description>FMU Command Check Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALIGNFAIL_PHR</name>
              <description>Phrase Alignment Fail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz149</name>
                  <description>The address is phrase-aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz150</name>
                  <description>The address is not phrase-aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALIGNFAIL_PG</name>
              <description>Page Alignment Fail</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz147</name>
                  <description>The address is page-aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz148</name>
                  <description>The address is not page-aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALIGNFAIL_SCR</name>
              <description>Sector Alignment Fail</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz145</name>
                  <description>The address is sector-aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz146</name>
                  <description>The address is not sector-aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALIGNFAIL_BLK</name>
              <description>Block Alignment Fail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz143</name>
                  <description>The address is block-aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz144</name>
                  <description>The address is not block-aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_FAIL</name>
              <description>Address Fail</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz141</name>
                  <description>The address is within the flash or IFR address space</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz142</name>
                  <description>The address is outside the flash or IFR address space</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFR_CMD</name>
              <description>IFR Command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz139</name>
                  <description>The command operates on a main flash address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz140</name>
                  <description>The command operates on an IFR address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALL_CMD</name>
              <description>All Blocks Command</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz137</name>
                  <description>The command operates on a single flash block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz138</name>
                  <description>The command operates on all flash blocks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_FAIL</name>
              <description>Address Range Fail</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz135</name>
                  <description>The address range is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz136</name>
                  <description>The address range is invalid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCR_ALIGN_CHK</name>
              <description>Sector Alignment Check</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz133</name>
                  <description>No sector alignment check</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz134</name>
                  <description>Sector alignment check</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPTION_FAIL</name>
              <description>Option Check Fail</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz131</name>
                  <description>Option check passes for read command or command is not a read command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz132</name>
                  <description>Option check fails for read command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILLEGAL_CMD</name>
              <description>Illegal Command</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz129</name>
                  <description>Command is legal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz130</name>
                  <description>Command is illegal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BSEL</name>
          <description>FMU Block Select Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SBSEL</name>
              <description>Slave Block Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBSEL</name>
              <description>Master Block Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSIZE</name>
          <description>FMU Memory Size Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXADDR0</name>
              <description>Size of Flash Block 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_RD_ADD</name>
          <description>Flash Read Address Register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_RD_ADD</name>
              <description>Flash Read Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_STOP_ADD</name>
          <description>Flash Stop Address Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_STOP_ADD</name>
              <description>Flash Stop Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_RD_CTRL</name>
          <description>Flash Read Control Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_RD</name>
              <description>Flash Read Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz155</name>
                  <description>Manual flash read not enabled.(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz156</name>
                  <description>Manual flash read enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIDE_LOAD</name>
              <description>Wide Load Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz153</name>
                  <description>Wide load mode disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz154</name>
                  <description>Wide load mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_RD</name>
              <description>Single Flash Read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz151</name>
                  <description>Normal UINT operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz152</name>
                  <description>UINT configured for single cycle reads</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_ADDR</name>
          <description>Memory Map Address Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MM_ADDR</name>
              <description>Memory Map Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_WDATA</name>
          <description>Memory Map Write Data Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MM_WDATA</name>
              <description>Memory Map Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_CTL</name>
          <description>Memory Map Control Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MM_SEL</name>
              <description>Register Access Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MM_RD</name>
              <description>Register R/W Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz161</name>
                  <description>Write to register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz162</name>
                  <description>Read register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_ON</name>
              <description>BIST on</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz159</name>
                  <description>BIST enable not forced by user interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz160</name>
                  <description>BIST enable control by user interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_SW_CLK</name>
              <description>Force Switch Clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz157</name>
                  <description>Switch clock not forced on (gated normally)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz158</name>
                  <description>Switch clock forced on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UINT_CTL</name>
          <description>User Interface Control Register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET_FAIL</name>
              <description>Set Fail On Exit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz165</name>
                  <description>FAIL flag should not be set on command exit (no failure detected)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz166</name>
                  <description>FAIL flag should be set on command exit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBERR</name>
              <description>Double-Bit ECC Fault Detect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz163</name>
                  <description>No double-bit fault detected during UINT-driven read sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz164</name>
                  <description>Double-bit fault detected during UINT-driven read sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_DATA0</name>
          <description>Read Data 0 Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DATA0</name>
              <description>Read Data 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_DATA1</name>
          <description>Read Data 1 Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DATA1</name>
              <description>Read Data 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_DATA2</name>
          <description>Read Data 2 Register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DATA2</name>
              <description>Read Data 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_DATA3</name>
          <description>Read Data 3 Register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_DATA3</name>
              <description>Read Data 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARITY</name>
          <description>Parity Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARITY</name>
              <description>Read data [136:128]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
