nxp-mcuxpresso/mcux-soc-svd/MCXC353/MCXC353.xml
        <register>
          <name>PORT_CTRL</name>
          <description>Port Control Register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BDONE_SEL</name>
              <description>BIST Done Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz453</name>
                  <description>Select internal bist_done signal from current module instantiation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz454</name>
                  <description>Select ipt_bist_fail signal from current module instantiation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz455</name>
                  <description>Select ipt_bist_done signal from other module instantiation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz456</name>
                  <description>Select AND of internal bist_done signal from current module instantiation with ipt_bist_done signal from other module instantiation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSDO_SEL</name>
              <description>BIST Serial Data Output Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz449</name>
                  <description>Select internal bist_sdo signal from current module instantiation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz450</name>
                  <description>Select ipt_bist_done signal from current module instantiation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz451</name>
                  <description>Select ipt_bist_sdo signal from other module instantiation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz452</name>
                  <description>Select ipt_bist_done signal from other module instantiation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>XBAR0</name>
      <description>XBAR</description>
      <groupName>XBAR</groupName>
      <baseAddress>0x40017000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x114</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>65</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SEL[%s]</name>
          <description>Crossbar Select Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WP</name>
              <description>Write Protect</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Writing to this register is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>No further writing to this register is allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTRL[%s]</name>
          <description>Crossbar Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEN</name>
              <description>DMA Enable for XBAR_OUTn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DMA disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEN</name>
              <description>Interrupt Enable for XBAR_OUTn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Active edge for edge detection on XBAR_OUTn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>STSn never asserts</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>STSn asserts on rising edges of XBAR_OUTn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>STSn asserts on falling edges of XBAR_OUTn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>STSn asserts on rising and falling edges of XBAR_OUTn</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Edge detection status for XBAR_OUTn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Active edge not yet detected on XBAR_OUTn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Active edge detected on XBAR_OUTn</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP</name>
              <description>Write Protect</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Writing to this register is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>No further writing to this register is allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
