nxp-mcuxpresso/mcux-soc-svd/MCXC353/MCXC353.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PWT0">
      <name>PWT1</name>
      <description>Pulse Width Timer</description>
      <groupName>PWT</groupName>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>PIT0</name>
      <description>PIT</description>
      <groupName>PIT</groupName>
      <baseAddress>0x4002D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>PIT Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_EN</name>
              <description>Count Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>PIT counter reset (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>PIT counter active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIE</name>
              <description>PIT Roll-Over Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>PIT roll-over interrupt disabled (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>PIT roll-over interrupt enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRF</name>
              <description>PIT Roll-Over Flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>PIT counter has not reached the modulo value. (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>PIT counter has reached the modulo value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>PRESCALER</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0000</name>
                  <description>Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0001</name>
                  <description>Clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0010</name>
                  <description>Clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0011</name>
                  <description>Clock divided by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0100</name>
                  <description>Clock divided by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0101</name>
                  <description>Clock divided by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0110</name>
                  <description>Clock divided by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL0111</name>
                  <description>Clock divided by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1000</name>
                  <description>Clock divided by 256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1001</name>
                  <description>Clock divided by 512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1010</name>
                  <description>Clock divided by 1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1011</name>
                  <description>Clock divided by 2048</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1100</name>
                  <description>Clock divided by 4096</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1101</name>
                  <description>Clock divided by 8192</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1110</name>
                  <description>Clock divided by 16384</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1111</name>
                  <description>Clock divided by 32768</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESET_POLARITY</name>
              <description>Preset Polarity.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>Preset signal take affect at positive edge. (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>Preset signal take affect at negative edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>CLKSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL00</name>
                  <description>Selects IP Bus clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL01</name>
                  <description>Selects alternate clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL10</name>
                  <description>Selects alternate clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL11</name>
                  <description>Selects alternate clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD_L</name>
          <description>PIT Modulo Register Low Half Word</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MODULO_VALUE</name>
              <description>MODULO_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD_H</name>
          <description>PIT Modulo Register High Half Word</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MODULO_VALUE</name>
              <description>MODULO_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR_L</name>
          <description>PIT Counter low half word Register</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER_VALUE</name>
              <description>COUNTER_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR_H</name>
          <description>PIT Counter high half word Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER_VALUE</name>
              <description>COUNTER_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT</name>
          <description>PIT Preset Filter Register</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PER</name>
              <description>Input Filter Sample Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>Input Filter Sample Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS</name>
              <description>Filter Clock Source selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>Peripheral Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>Prescaled peripheral clock by PRSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSC</name>
              <description>Prescaler</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>PIT Preset Filter Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>STRETCH_COUNT</name>
              <description>The cycle number to be stretched for SYNC_OUT signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_OUT_SEL</name>
              <description>SYNC_OUT_SEL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>SYNC_OUT take affect when PIT counter equal MODULO value.(default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>SYNC_OUT is in toggle mode: after reset, SYNC_OUT is low-level, when PIT counter equals MODULO value firstly, SYNC_OUT toggles to high-level and keep high-level until PIT counter equal MODULO value next time, SYNC_OUT toggles to low-level, and so on....</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
