nxp-mcuxpresso/mcux-soc-svd/MCXC353/MCXC353.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP0</name>
      <description>OPAMP</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x40037000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>OPAMP Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IREF_CONFIG</name>
              <description>Iref Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREF0</name>
                  <description>bias current ratio=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF1</name>
                  <description>bias current ratio=1/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF2</name>
                  <description>bias current ratio=1/2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF3</name>
                  <description>bias current ratio=3/2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOS_TRIM</name>
              <description>Input Offset Voltage Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOS07_0</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_1</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_2</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_3</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_4</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_5</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_6</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS07_7</name>
                  <description>input offset voltage trim=0v</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS8</name>
                  <description>input offset voltage trim=0.0015v</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS9</name>
                  <description>input offset voltage trim=0.003v</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS10</name>
                  <description>input offset voltage trim=0.0045v</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS11</name>
                  <description>input offset voltage trim=0.006v</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS12</name>
                  <description>input offset voltage trim=-0.0015v</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS13</name>
                  <description>input offset voltage trim=-0.003v</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS14</name>
                  <description>input offset voltage trim=-0.0045v</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS15</name>
                  <description>input offset voltage trim=-0.006v</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN_CONFIG</name>
              <description>Gain Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN0</name>
                  <description>set OPAMP gain to 3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN1</name>
                  <description>set OPAMP gain to 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN2</name>
                  <description>set OPAMP gain to 5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN3</name>
                  <description>set OPAMP gain to 6.5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN4</name>
                  <description>set OPAMP gain to 9</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN5</name>
                  <description>set OPAMP gain to 11</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN6</name>
                  <description>set OPAMP gain to 14</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN7</name>
                  <description>set OPAMP gain to 19</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC_CONFIG</name>
              <description>Capacitance Compensation Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CC7</name>
                  <description>when gain=3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC8</name>
                  <description>when gain=4</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC9</name>
                  <description>when gain=5</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC11</name>
                  <description>when gain=6.5</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC12</name>
                  <description>when gain=9</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC13</name>
                  <description>when gain=11</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC14</name>
                  <description>when gain=14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC15</name>
                  <description>when gain=19</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFSET_SEL</name>
              <description>Offset Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFT0</name>
                  <description>Vref=vdda/2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFT1</name>
                  <description>Vref=vdda/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFT2</name>
                  <description>Vref=vdda/8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA</name>
              <description>OPAMP Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable OPAMP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable OPAMP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
