nxp-mcuxpresso/mcux-soc-svd/MCXC353/MCXC353.xml
        <register>
          <name>RES_STATUS</name>
          <description>Result Status</description>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RES0_NX</name>
              <description>RES0 IEEE Inexact Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_NX_NO</name>
                  <description>The result is not rounded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_NX_YES</name>
                  <description>The result is rounded, and as a result some digits lost.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_UF</name>
              <description>RES0 IEEE Underflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_UF_NO</name>
                  <description>No tiny non-zero result is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_UF_YES</name>
                  <description>A tiny non-zero result is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_OF</name>
              <description>RES0 IEEE Overflow Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_OF_NO</name>
                  <description>The result format's largest finite number is not exceeded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_OF_YES</name>
                  <description>The result format's largest finite number is exceeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_DZ</name>
              <description>RES0 IEEE Divide by Zero Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_DZ_NO</name>
                  <description>No exact infinite result is defined for an operation on finite operands.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_DZ_YES</name>
                  <description>An exact infinite result is defined for an operation on finite operands.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_NV</name>
              <description>RES0 IEEE Invalid Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_NV_NO</name>
                  <description>There is usefully definable result.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_NV_YES</name>
                  <description>There is no usefully definable result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_ERR</name>
              <description>RES0 Indirect Operation Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_ERR_NO</name>
                  <description>No invalid indirect operation is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_ERR_YES</name>
                  <description>An invalid indirect operation error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_OVWR</name>
              <description>RES0 Overwrite Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_OVWR_NO</name>
                  <description>The value of RES0 has been read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_OVWR_YES</name>
                  <description>The value of RES0 has not been read yet and is overwritten by a new MAUWRAP result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES0_FULL</name>
              <description>RES0 Full Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0_FULL_NO</name>
                  <description>RES0 has not updated and cannot be read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0_FULL_YES</name>
                  <description>RES0 has updated and can be read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_NX</name>
              <description>RES1 IEEE Inexact Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_NX_NO</name>
                  <description>The result is not rounded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_NX_YES</name>
                  <description>The result is rounded, and as a result some digits lost.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_UF</name>
              <description>RES1 IEEE Underflow Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_UF_NO</name>
                  <description>No tiny non-zero result is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_UF_YES</name>
                  <description>A tiny non-zero result is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_OF</name>
              <description>RES1 IEEE Overflow Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_OF_NO</name>
                  <description>The result format's largest finite number is not exceeded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_OF_YES</name>
                  <description>The result format's largest finite number is exceeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_DZ</name>
              <description>RES1 IEEE Divide by Zero Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_DZ_NO</name>
                  <description>No exact infinite result is defined for an operation on finite operands.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_DZ_YES</name>
                  <description>An exact infinite result is defined for an operation on finite operands.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_NV</name>
              <description>RES1 IEEE Invalid Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_NV_NO</name>
                  <description>There is usefully definable result.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_NV_YES</name>
                  <description>There is no usefully definable result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_ERR</name>
              <description>RES1 Indirect Operation Error Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_ERR_NO</name>
                  <description>No invalid indirect operation is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_ERR_YES</name>
                  <description>An invalid indirect operation error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_OVWR</name>
              <description>RES1 Overwrite Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_OVWR_NO</name>
                  <description>The value of RES1 has been read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_OVWR_YES</name>
                  <description>The value of RES1 has not been read yet and is overwritten by a new MAUWRAP result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES1_FULL</name>
              <description>RES1 Full Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES1_FULL_NO</name>
                  <description>RES1 has not updated and cannot be read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1_FULL_YES</name>
                  <description>RES1 has updated and can be read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_NX</name>
              <description>RES2 IEEE Inexact Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_NX_NO</name>
                  <description>The result is not rounded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_NX_YES</name>
                  <description>The result is rounded, and as a result some digits lost.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_UF</name>
              <description>RES2 IEEE Underflow Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_UF_NO</name>
                  <description>No tiny non-zero result is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_UF_YES</name>
                  <description>A tiny non-zero result is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_OF</name>
              <description>RES2 IEEE Overflow Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_OF_NO</name>
                  <description>The result format's largest finite number is not exceeded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_OF_YES</name>
                  <description>The result format's largest finite number is exceeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_DZ</name>
              <description>RES2 IEEE Divide by Zero Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_DZ_NO</name>
                  <description>No exact infinite result is defined for an operation on finite operands.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_DZ_YES</name>
                  <description>An exact infinite result is defined for an operation on finite operands.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_NV</name>
              <description>RES2 IEEE Invalid Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_NV_NO</name>
                  <description>There is usefully definable result.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_NV_YES</name>
                  <description>There is no usefully definable result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_ERR</name>
              <description>RES2 Indirect Operation Error Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_ERR_NO</name>
                  <description>No invalid indirect operation is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_ERR_YES</name>
                  <description>An invalid indirect operation error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_OVWR</name>
              <description>RES2 Overwrite Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_OVWR_NO</name>
                  <description>The value of RES2 has been read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_OVWR_YES</name>
                  <description>The value of RES2 has not been read yet and is overwritten by a new MAUWRAP result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES2_FULL</name>
              <description>RES2 Full Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES2_FULL_NO</name>
                  <description>RES2 has not updated and cannot be read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2_FULL_YES</name>
                  <description>RES2 has updated and can be read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_NX</name>
              <description>RES3 IEEE Inexact Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES3_NX_NO</name>
                  <description>The result is not rounded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3_NX_YES</name>
                  <description>The result is rounded, and as a result some digits lost.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_UF</name>
              <description>RES3 IEEE Underflow Flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES3_UF_NO</name>
                  <description>No tiny non-zero result is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3_UF_YES</name>
                  <description>A tiny non-zero result is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_OF</name>
              <description>RES3 IEEE Overflow Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES3_OF_NO</name>
                  <description>The result format's largest finite number is not exceeded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3_OF_YES</name>
                  <description>The result format's largest finite number is exceeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_DZ</name>
              <description>RES3 IEEE Divide by Zero Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES3_DZ_NO</name>
                  <description>No exact infinite result is defined for an operation on finite operands.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3_DZ_YES</name>
                  <description>An exact infinite result is defined for an operation on finite operands.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_NV</name>
              <description>RES3 IEEE Invalid Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES3_NV_NO</name>
                  <description>There is usefully definable result.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3_NV_YES</name>
                  <description>There is no usefully definable result.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES3_ERR</name>
              <description>RES3 Indirect Operation Error Flag</description>
